{"his1A": "The student understands how constitutional government, as developed in America and expressed in the Declaration of Independence, the Articles of Confederation, and the U.S. Constitution, has been influenced by ideas, people, and historical documents. The student is expected to:explain major political ideas in history, including the laws of nature and nature\\'s God, unalienable rights, divine right of kings, social contract theory, and the rights of resistance to illegitimate government;", "his1B": "The student understands how constitutional government, as developed in America and expressed in the Declaration of Independence, the Articles of Confederation, and the U.S. Constitution, has been influenced by ideas, people, and historical documents. The student is expected to:identify major intellectual, philosophical, political, and religious traditions that informed the American founding, including Judeo-Christian (especially biblical law), English common law and constitutionalism, Enlightenment, and republicanism, as they address issues of liberty, rights, and responsibilities of individuals;", "his1C": "The student understands how constitutional government, as developed in America and expressed in the Declaration of Independence, the Articles of Confederation, and the U.S. Constitution, has been influenced by ideas, people, and historical documents. The student is expected to:identify the individuals whose principles of laws and government institutions informed the American founding documents, including those of Moses, William Blackstone, John Locke, and Charles de Montesquieu;", "his1D": "The student understands how constitutional government, as developed in America and expressed in the Declaration of Independence, the Articles of Confederation, and the U.S. Constitution, has been influenced by ideas, people, and historical documents. The student is expected to:identify the contributions of the political philosophies of the Founding Fathers, including John Adams, Alexander Hamilton, Thomas Jefferson, James Madison, John Jay, George Mason, Roger Sherman, and James Wilson, on the development of the U.S. government;", "his1E": "The student understands how constitutional government, as developed in America and expressed in the Declaration of Independence, the Articles of Confederation, and the U.S. Constitution, has been influenced by ideas, people, and historical documents. The student is expected to:examine debates and compromises that impacted the creation of the founding documents; and", "his1F": "The student understands how constitutional government, as developed in America and expressed in the Declaration of Independence, the Articles of Confederation, and the U.S. Constitution, has been influenced by ideas, people, and historical documents. The student is expected to:identify significant individuals in the field of government and politics, including <span class=paragraph1Char>George Washington,</span> Thomas Jefferson, John Marshall, Andrew Jackson, Abraham Lincoln, Theodore Roosevelt, Franklin D. Roosevelt, and Ronald Reagan.", "his2A": "The student understands the roles played by individuals, political parties, interest groups, and the media in the U.S. political system, past and present. The student is expected to:give examples of the processes used by individuals, political parties, interest groups, or the media to affect public policy; and", "his2B": "The student understands the roles played by individuals, political parties, interest groups, and the media in the U.S. political system, past and present. The student is expected to:analyze the impact of political changes brought about by individuals, political parties, interest groups, or the media, past and present.", "geo3A": "The student understands how geography can influence U.S. political divisions and policies. The student is expected to:understand how population shifts affect voting patterns;", "geo3B": "The student understands how geography can influence U.S. political divisions and policies. The student is expected to:examine political boundaries to make inferences regarding the distribution of political power; and", "geo3C": "The student understands how geography can influence U.S. political divisions and policies. The student is expected to:explain how political divisions are crafted and how they are affected by Supreme Court decisions such as Baker v. Carr.", "geo4A": "The student understands why certain places or regions are important to the United States. The student is expected to:identify the significance to the United States of the location and key natural resources of selected global places or regions; and", "geo4B": "The student understands why certain places or regions are important to the United States. The student is expected to:analyze how U.S. foreign policy affects selected places and regions.", "eco5A": "The student understands the roles played by local, state, and national governments in both the public and private sectors of the U.S. free enterprise system. The student is expected to:explain how government fiscal, monetary, and regulatory policies<span class=paragraph1Char> </span>influence the economy at the local, state, and national levels;", "eco5B": "The student understands the roles played by local, state, and national governments in both the public and private sectors of the U.S. free enterprise system. The student is expected to:identify the sources of revenue and expenditures of the U. S. government and analyze their impact on the U.S. economy;", "eco5C": "The student understands the roles played by local, state, and national governments in both the public and private sectors of the U.S. free enterprise system. The student is expected to:compare the role of government in the U.S. free enterprise system and other economic systems; and", "eco5D": "The student understands the roles played by local, state, and national governments in both the public and private sectors of the U.S. free enterprise system. The student is expected to:understand how government taxation and regulation can serve as restrictions to private enterprise.", "eco6A": "The student understands the relationship between U.S. government policies and the economy. The student is expected to:examine how the U.S. government uses economic resources in foreign policy; and", "eco6B": "The student understands the relationship between U.S. government policies and the economy. The student is expected to:understand the roles of the executive and legislative branches in setting international trade and fiscal policies.", "gov7A": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:explain the importance of a written constitution;", "gov7B": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:evaluate how the federal government serves the purposes set forth in the Preamble to the U.S. Constitution;", "gov7C": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:analyze how the Federalist Papers such as Number 10, Number 39, and Number 51 explain the principles of the American constitutional system of government;", "gov7D": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:evaluate constitutional provisions for limiting the role of government, including republicanism, checks and balances, federalism, separation of powers, popular sovereignty, and individual rights;", "gov7E": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:describe the constitutionally prescribed procedures by which the U.S. Constitution can be changed and analyze the role of the amendment process in a constitutional government;", "gov7F": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:identify how the American beliefs and principles reflected in the Declaration of Independence and the U.S. Constitution <span class=paragraph1Char>contribute to both a national identity and federal identity and</span> are embodied in the United States today; and", "gov7G": "The student understands the American beliefs and principles reflected in the U.S. Constitution and why these are significant. The student is expected to:examine the reasons the Founding Fathers protected religious freedom in America and guaranteed its free exercise by saying that &quot;Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof,&quot; and compare and contrast this to the phrase, &quot;separation of church and state.&quot;", "gov8A": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:analyze the structure and functions of the legislative branch of government, including the bicameral structure of Congress, the role of committees, and the procedure for enacting laws;", "gov8B": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:analyze the structure and functions of the executive branch of government, including the constitutional powers of the president, the growth of presidential power, and the role of the Cabinet and executive departments;", "gov8C": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:analyze the structure and functions of the judicial branch of government, including the federal court system, types of jurisdiction, and judicial review;", "gov8D": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:identify the purpose of selected independent executive agencies, including the National Aeronautics and Space Administration (NASA), and regulatory commissions, including the Environmental Protection Agency (EPA), Occupational Safety and Health Administration (OSHA), Food and Drug Administration (FDA), and Federal Communications Commission (FCC);", "gov8E": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:explain how certain provisions of the U.S. Constitution provide for checks and balances among the three branches of government;", "gov8F": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:analyze selected issues raised by judicial activism and judicial restraint;", "gov8G": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:explain the major responsibilities of the federal government for domestic and foreign policy such as national defense; and", "gov8H": "The student understands the structure and functions of the government created by the U.S. Constitution. The student is expected to:compare the structures, functions, and processes of national, state, and local governments in the U.S. federal system.", "gov9A": "The student understands the concept of federalism. The student is expected to:explain why the Founding Fathers created a distinctly new form of federalism and adopted a federal system of government instead of a unitary system;", "gov9B": "The student understands the concept of federalism. The student is expected to:categorize government powers as national, state, or shared;", "gov9C": "The student understands the concept of federalism. The student is expected to:analyze historical and contemporary conflicts over the respective roles of national and state governments; and", "gov9D": "The student understands the concept of federalism. The student is expected to:understand the limits on the national and state governments in the U.S. federal system of government.", "gov10A": "The student understands the processes for filling public offices in the U.S. system of government. The student is expected to:compare different methods of filling public offices, including elected and appointed offices at the local, state, and national levels;", "gov10B": "The student understands the processes for filling public offices in the U.S. system of government. The student is expected to:explain the process of electing the president of the United States and analyze the Electoral College; and", "gov10C": "The student understands the processes for filling public offices in the U.S. system of government. The student is expected to:analyze the impact of the passage of the 17th Amendment.", "gov11A": "The student understands the role of political parties in the U.S. system of government. The student is expected to:analyze the functions of political parties and their role in the electoral process at local, state, and national levels;", "gov11B": "The student understands the role of political parties in the U.S. system of government. The student is expected to:explain the two-party system and evaluate the role of third parties in the United States; and", "gov11C": "The student understands the role of political parties in the U.S. system of government. The student is expected to:identify opportunities for citizens to participate in political party activities at local, state, and national levels.", "gov12A": "The student understands the similarities and differences that exist among the U.S. system of government and other political systems. The student is expected to:compare the U.S. constitutional republic to historical and contemporary forms of government such as monarchy, a classical republic, authoritarian, socialist, direct democracy, theocracy, tribal, and other republics;", "gov12B": "The student understands the similarities and differences that exist among the U.S. system of government and other political systems. The student is expected to:analyze advantages and disadvantages of federal, confederate, and unitary systems of government; and", "gov12C": "The student understands the similarities and differences that exist among the U.S. system of government and other political systems. The student is expected to:analyze advantages and disadvantages of presidential and parliamentary systems of government.", "cit13A": "The student understands rights guaranteed by the U.S. Constitution. The student is expected to:understand the roles of limited government and the rule of law in the protection of individual rights;", "cit13B": "The student understands rights guaranteed by the U.S. Constitution. The student is expected to:identify and define the unalienable rights;", "cit13C": "The student understands rights guaranteed by the U.S. Constitution. The student is expected to:identify the freedoms and rights guaranteed by each amendment in the Bill of Rights;", "cit13D": "The student understands rights guaranteed by the U.S. Constitution. The student is expected to:analyze U.S. Supreme Court interpretations of rights guaranteed by the U.S. Constitution in selected cases, including Engel v. Vitale, Schenck v. United States, Texas v. Johnson, Miranda v. Arizona, Gideon v. Wainwright, Mapp v. Ohio, and Roe v. Wade;", "cit13E": "The student understands rights guaranteed by the U.S. Constitution. The student is expected to:explain the importance of due process rights to the protection of individual rights and in limiting the powers of government; and", "cit13F": "The student understands rights guaranteed by the U.S. Constitution. The student is expected to:recall the conditions that produced the 14th Amendment and describe subsequent efforts to selectively extend some of the Bill of Rights to the states, including the Blaine Amendment and U.S. Supreme Court rulings, and analyze the impact on the scope of fundamental rights and federalism.", "cit14A": "The student understands the difference between personal and civic responsibilities. The student is expected to:explain the difference between personal and civic responsibilities;", "cit14B": "The student understands the difference between personal and civic responsibilities. The student is expected to:evaluate whether and/or when the obligation of citizenship requires that personal desires and interests be subordinated to the public good;", "cit14C": "The student understands the difference between personal and civic responsibilities. The student is expected to:understand the responsibilities, duties, and obligations of citizenship such as being well informed about civic affairs, serving in the military, voting, serving on a jury, observing the laws, paying taxes, and serving the public good; and", "cit14D": "The student understands the difference between personal and civic responsibilities. The student is expected to:understand the voter registration process and the criteria for voting in elections.", "cit15A": "The student understands the importance of voluntary individual participation in the U.S. constitutional republic. The student is expected to:analyze the effectiveness of various methods of participation in the political process at local, state, and national levels;", "cit15B": "The student understands the importance of voluntary individual participation in the U.S. constitutional republic. The student is expected to:analyze historical and contemporary examples of citizen movements to bring about political change or to maintain continuity; and", "cit15C": "The student understands the importance of voluntary individual participation in the U.S. constitutional republic. The student is expected to:understand the factors that influence an individual\\'s political attitudes and actions.", "cit16A": "The student understands the importance of the expression of different points of view in a constitutional republic. The student is expected to:examine different points of view of political parties and interest groups such as the League of United Latin American Citizens (LULAC), the National Rifle Association (NRA), and the National Association for the Advancement of Colored People (NAACP) on important contemporary issues; and", "cit16B": "The student understands the importance of the expression of different points of view in a constitutional republic. The student is expected to:analyze the importance of the First Amendment rights of petition, assembly, speech, and press and the Second Amendment right to keep and bear arms.", "cul17A": "The student understands the relationship between government policies and the culture of the United States. The student is expected to:evaluate a U.S. <span\\r\\nclass=paragraph1Char>government</span> policy or court decision that has affected a particular racial, ethnic, or religious group such as the Civil Rights Act of 1964 and the U.S. Supreme Court cases of Hernandez v. Texas and Grutter v. Bollinger; and", "cul17B": "The student understands the relationship between government policies and the culture of the United States. The student is expected to:explain changes in American culture brought about by government policies such as voting rights, the Servicemen\\'s Readjustment Act of 1944 (GI Bill of Rights), the Immigration and Nationality Act of 1965, the Immigration Reform and Control Act of 1986, affirmative action, and racial integration.", "sci18A": "The student understands the role the government plays in developing policies and establishing conditions that influence scientific discoveries and technological innovations. The student is expected to:understand how U.S. constitutional protections such as patents have fostered competition and entrepreneurship; and", "sci18B": "The student understands the role the government plays in developing policies and establishing conditions that influence scientific discoveries and technological innovations. The student is expected to:identify examples of government-assisted research that, when shared with the private sector, have resulted in improved consumer products such as computer and communication technologies.", "sci19A": "The student understands the impact of advances in science and technology on government and society. The student is expected to:understand the potential impact on society of recent scientific discoveries and technological innovations; and", "sci19B": "The student understands the impact of advances in science and technology on government and society. The student is expected to:evaluate the impact of the Internet and other electronic information on the political process.", "soc20A": "The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:analyze information by sequencing, categorizing, identifying cause-and-effect relationships, comparing, contrasting, finding the main idea, summarizing, making generalizations and predictions, and drawing inferences and conclusions;", "soc20B": "The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:create a product on a contemporary government issue or topic using critical methods of inquiry;", "soc20C": "The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:analyze and defend a point of view on a current political issue;", "soc20D": "The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:analyze and evaluate the validity of information, arguments, and counterarguments from primary and secondary sources for bias, propaganda, point of view, and frame of reference;", "soc20E": "The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:evaluate government data using charts, tables, graphs, and maps; and", "soc20F": "The student applies critical-thinking skills to organize and use information acquired from a variety of valid sources, including electronic technology. The student is expected to:use appropriate mathematical skills to interpret social studies information such as maps and graphs.", "soc21A": "The student communicates in written, oral, and visual forms. The student is expected to:use social studies terminology correctly;", "soc21B": "The student communicates in written, oral, and visual forms. The student is expected to:use standard grammar, spelling, sentence structure, and punctuation;", "soc21C": "The student communicates in written, oral, and visual forms. The student is expected to:transfer information from one medium to another, including written to visual and statistical to written or visual, using computer software as appropriate; and", "soc21D": "The student communicates in written, oral, and visual forms. The student is expected to:create written, oral, and visual presentations of social studies information.", "soc22A": "The student uses problem-solving and decision-making skills, working independently and with others, in a variety of settings. The student is expected to:use a problem-solving process to identify a problem, gather information, list and consider options, consider advantages and disadvantages, choose and implement a solution, and evaluate the effectiveness of the solution; and", "soc22B": "The student uses problem-solving and decision-making skills, working independently and with others, in a variety of settings. The student is expected to:use a decision-making process to identify a situation that requires a decision, gather information, identify options, predict consequences, and take action to implement a decision."}